import collections

fathers_map = {
    "Дэвид А. Тћрнер": "SASL, KRC, Miranda",
    "Кен Томпсон": "C",
    "Ларри Уолл": "Perl",
    "Гарольд Абельсон": "Лого",
    "Кеннет Юджин Айверсон": "APL",
    "Андрей Александреску": "D",
    "Альфред Ахо": "AWK",
    "Джереми Ашкенас": "сoffeeScript",
    "Стивен Ричард Борн": "C",
    "Уолтер Брайт": "D",
    "Пол Грэм": "Lisp",
    "Оле-Йохан Даль": "Симула",
    "Эдсгер Вибе Дейкстра": "Алгол",
    "Роберту Иерузалимски": "Lua",
     "Ричард Мэттью Столлман": "GNU",
    "Бьёрн Страуструп": "C++",
    "Грейс Хоппер": "COBOL",
    "Конрад Эрнст Отто Цузе": "Планкалкюль",
    "Жан Давид Ишбиа": "Ада, LIS",
    "Джон Джордж Кемени": "Basic",
    "Брайан Уилсон Керниган": "AWK",
    "Дональд Эрвин Кнут": "Metafont",
    "Ксавье Лерой": "OCaml",
    "Томас Курц": "Basic",
    "Алан Кертис Кэй": "Smalltalk",
    "Джеймс Лайон": "Intercal",
    "Легалов Александр Иванович": "Пифагор",
    "Расмус Лердорф": "PHP",
    "Барбара Лисков": "Клу",
    "Джон Маккарти": "Лисп",
    "Юкихиро Мацумото": "Ruby",
    "Бертран Мейер": "Эйфель",
    "Робин Милнер": "ML",
    "Чарльз Мур": "Форт",
    "Петер Наур": "Алгол",
    "Рэндалл Хайд": "HLA",
    "Андерс Хейлсберг": "Delphi",
    "Ричард Хикки": "Clojure",
    "Кристен Нюгор": "Симула",
    "Маркус Хендрик Овермарс": "",
    "Родриго Баррето де Оливейра": "Boo",
    "Джон Бэкус": "Фортран",
    "Гвидо Ван Россум": "Python",
    "Никлаус Вирт": "Паскаль, Модула-2, Оберон",
    "Дон Дудс": "Intercal",
    "Джеймс Гослинг": "Java",
    "Джон Оустерхаут": "Tcl",
    "Роб Пайк": "Go, Limbo, Sawzall, Newsqueak",
    "Сеймур Пейперт": "Logo",
    "Святослав Пестов": "Factor",
    "Деннис Макалистэйр Ритчи": "BCOL, B, C",
    "Дон Сайм": "F#"
}


def get_num():
    try:
        kom = int(input("Введите команду: "))
    except ValueError:
        kom = 0
    return kom


print("Список команд: \n1 - Найти язык программирования.\n2 - Отсортировать словарь.\n3 - Выход из программы.")
operation = get_num()
while operation < 0:
    print("Такой команды нет. Введмте конманду из списка.")
    operation = get_num()

if operation == 3:
    print("Goodbye")

if operation == 1:
    try:
        name = input("Введите имя создателя: ")
        print("Этот человек создатель языков программрования: ", fathers_map[name])
    except KeyError:
        print("Введите Имя и Фамилию полностью, и в названиии не должны содержаться цифры.")

if operation == 2:
    new_list = collections.OrderedDict(sorted(fathers_map.items()))
    for key, value in new_list.items():
        print(key, ". Язык программирования: ", value)
